# Встроенная функция input позволяет ожидать и возвращать данные из стандартного ввода в виде строки (весь введенный пользователем текст до нажатия им enter). Используя данную функцию, напишите программу, которая:

1. После запуска предлагает пользователю ввести текст.
2. В качестве ответа печатает наиболее часто встречающееся в тексте слово
или несколько таких слов, если имеет место "ничья". Также указывая
сколько именно раз слово встретилось в тексте. (Игнорируйте заглавные буквы
при отождествлении слов - то есть считайте слова "Подлодка" и "подлодка"
одинаковыми, а разные формы слов - разными словами)
После чего ждет следующего ввода.
```
Пример:

-> собака кот кошка Собака
2 - собака

-> собака кот кошка Собака кот
2 - собака
2 - кот
```

## Решение
```
from collections import Counter # импортируем класс Counter из модуля collections
words = input('Input some words:')  # получаем строку
myList = words.lower().split(" ")  # создаем список из words в нижнем регистре
# print(myList)
# из списка myList получаем класс Counter, содержащий словарь повторов значений списка
c = Counter(myList)
# print(dict(c))
# находим среди значений словаря максимальное значение
max_value = max(dict(c).values())
# выбираем ключи, соответствующие max_value
final_dict = {k: v for k, v in dict(c).items() if v == max_value}
# print(final_dict)

for k, v in final_dict.items():
    # печатаем эти максимальные значения с сепаратором "дефис"
    print(v, k, sep=' - ')

```

## Получаем
```
PS C:\Users\Sergey\Documents\Python> & C:/Python39/python.exe "c:/Users/Sergey/Documents/Python/hw3 python.py"
Input some words:кошка соБака собака Собака кошка Кот лошадь лошадь Лошадь 
3 - собака
3 - лошадь
```