## Встроенная функция input позволяет ожидать и возвращать данные из стандартного ввода ввиде строк (весь введенный пользователем текст до нажатия им enter). Используя данную функцию, напишите программу, которая:

1. После запуска предлагает пользователю ввести целые неотрицательные числа,
разделенные любым не цифровым литералом (пробел, запятая, %, буква и т.д.).
2. Получив вводные данные, выделяет полученные числа, суммирует их,
и печатает полученную сумму.

Например:
```
-> 12 12 12
36

-> 123dfgdr%0&45ty-45--900
-777
```
## Решение:
```
import re  # импортируем модуль регулярок
string = input("Input numbers:")  # запрашиваем строку с числами
# находим все числа, в т.ч. отрицательные, получаем список строк
result = re.findall(r'\-?\d+', string)
# print(result)
arr = [int(item) for item in result]  # генерируем список чисел из списка строк
print(sum(arr))  # печатаем сумму элементов списка чисел
```

## Результат
```
PS C:\Users\borisov_sv\Documents\web\2021\css_2> & C:/Python39/python.exe c:/Users/borisov_sv/Documents/hw4.py
Input numbers:100аавеквекв№№№%%-60-78енаена+90
52
```
